RIET/src/Catalogs/ProcessLevels/ProcessLevels.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ProcessLevels</name>
  <predefined>
    <items>
      <name>AZ</name>
      <description>Azerbaijan</description>
    </items>
    <items>
      <name>GE</name>
      <description>Georgia</description>
    </items>
    <items>
      <name>KZ</name>
      <description>Kazakhstan</description>
    </items>
    <items>
      <name>RUEA</name>
      <description>Russia East</description>
    </items>
    <items>
      <name>RUSM</name>
      <description>Russia Smith</description>
    </items>
    <items>
      <name>RUWE</name>
      <description>Russia West</description>
    </items>
    <items>
      <name>TM</name>
      <description>TM</description>
    </items>
    <items>
      <name>UZ</name>
      <description>Uzbekistan</description>
    </items>
  </predefined>
  <attributes>
    <name>Country</name>
    <type>
      <types>CatalogRef.CountriesOfProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>Corporation</name>
    <type>
      <types>CatalogRef.Corporations</types>
    </type>
  </attributes>
  <attributes>
    <name>LeaveDocumentsInDesktopUntilAllItemsAreInCustomsFiles</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>EMailsForTemporaryItemsNotification</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FromTMSIDsList</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>FromTMSIDs</name>
    <attributes>
      <name>FromTMSID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RIET/src/Catalogs/ProcessLevels/ManagerModule.bsl
Функция ПолучитьПоCountryCodeИTMSID(CountryCode, TMSID) Экспорт
	
	// Получает Process level по CountryCode (3х буквенный) и TMSID
	// TMSID недостаточно, так как в TMS есть Corporation KZUZ, а у нас это 2 разных процесс-левела
	// Если Process level не найден или найдено несколько - возвращает Неопределено
	
	Если НЕ ЗначениеЗаполнено(CountryCode) ИЛИ НЕ ЗначениеЗаполнено(TMSID) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("TMSID", TMSID);
	Запрос.УстановитьПараметр("CountryCode", CountryCode);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ProcessLevelsFromTMSIDs.Ссылка
		|ИЗ
		|	Справочник.ProcessLevels.FromTMSIDs КАК ProcessLevelsFromTMSIDs
		|ГДЕ
		|	ProcessLevelsFromTMSIDs.Ссылка.Country.TMSID = &CountryCode
		|	И ProcessLevelsFromTMSIDs.FromTMSID = &TMSID
		|	И НЕ ProcessLevelsFromTMSIDs.Ссылка.ПометкаУдаления";
		
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;

    Выборка = Результат.Выбрать();
	Если Выборка.Количество() > 1 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка.Следующий();
	Возврат Выборка.Ссылка;	
	
КонецФункции

Функция ПолучитьПоRCACountry(RCACountry) Экспорт
		
	Возврат РГСофт.НайтиСсылку("Справочник", "ProcessLevels", "Country", RCACountry);
		
КонецФункции
